{
	"landing": {
		"title": "Luis Espinoza\nMobile & Web Engineer",
		"message": "I build high-performance experiences with React, React Native and Node.js. I deliver FinTech & EventTech apps that reach thousands of users every month.",
		"button": "Let's talk"
	},
	"header": {
		"skills": "Skills",
		"works": "Works",
		"ethos": "Ethos",
		"contact": "Contact",
		"cv": "CV",
		"download_cv": "Download"
	},
	"skills": {
		"title": "SKILLS",
		"sections": {
			"0": {
				"title": "Frontend & Mobile Development",
				"item_0": "React & React Native: Building modular, high-performance interfaces for web and mobile, following accessibility and SEO best practices.",
				"item_1": "HTML, CSS, JavaScript: Semantic, responsive and optimized code that delivers a consistent experience on any device.",
				"item_2": "UI/UX & Prototyping: Crafting flows and prototypes in Figma and translating them into scalable TypeScript components with CSS Modules.",
				"item_3": "Version Control: Proficient with Git (GitFlow, PR reviews, CI/CD) and collaboration in distributed teams."
			},
			"1": {
				"title": "Architecture & App Design",
				"item_0": "Clean Architecture & SOLID: Structuring React/React Native projects for scalability and maintainability.",
				"item_1": "Responsive & Accessible Design: WCAG-compliant, mobile-first experiences that reach 100% of the audience.",
				"item_2": "Backend-as-a-Service: Firebase (Auth, Firestore, Cloud Functions) and AWS Serverless to accelerate time-to-market."
			},
			"2": {
				"title": "Project Management & Collaboration",
				"item_0": "Agile methodologies (Scrum, Kanban) with tools like Jira or Linear for iterative delivery.",
				"item_1": "Acting as a bridge between business and tech, enabling informed decisions and team efficiency."
			},
			"3": {
				"title": "Problem Solving & Continuous Learning",
				"item_0": "Debugging & Tuning: Identifying bottlenecks using profiling and observability tools.",
				"item_1": "Continuous learning: Self-directed research and rapid adaptation to new technologies.",
				"item_2": "Innovation: Proposing improvements and automations that cut development time and errors."
			}
		}
	},
	"ethos": {
		"title": "ETHOS",
		"content_1": "Idea explorer: from Philosophy to Engineering, I blend critical thinking and creativity to design technology that improves people's lives.",
		"content_2": "I craft digital experiences, driven by a continuous-learning mindset and passion for excellence.",
		"content_3": "Curiosity is fueled by reading, writing and art; these disciplines broaden my perspective and empower me to solve problems in innovative ways.",
		"content_4": "I operate on values of trust, transparent communication and collaboration, enabling teams to build sustainable, memorable products."
	},
	"works": {
		"title": "WORKS",
		"projects": {
			"Pago Fácil & Western Union": {
				"name": "Pago Fácil & Western Union",
				"description": "I contribute to the evolution of Pago Fácil — a digital wallet built with Western Union. With over one million downloads and hundreds of thousands of active users, I lead new features and refactors that boost performance and UX while ensuring production stability. Stack: React Native, TypeScript, Redux, REST APIs and Clean Architecture."
			},
			"0-Registros": {
				"name": "0-Registros",
				"description": "Experimental web project merging poetry, generative art and technology to explore existential questions. Built with Next.js & TypeScript (monorepo), using p5.js for dynamic visuals, Firebase backend and i18n. Crafted a minimalist immersive experience where text intertwines with real-time graphics."
			},
			"Hybeans App": {
				"name": "Hybeans App",
				"description": "At Hybeans — an event management platform with social features — I designed and shipped critical modules for iOS and Android: authentication, dynamic profiles, real-time feed, push notifications, booking engine and in-app product sales. Collaborated with design, backend and QA teams to deliver releases on tight deadlines, ensuring stable performance during live events."
			},
			"FastForm": {
				"name": "Fast Form",
				"description": "FastForm is a SaaS web application that automates the creation of Google Forms through a set of tools: an AI-powered chat that guides and optimizes form generation, the ability to automatically import from Excel/CSV files, and an intuitive manual builder with options to save drafts and combine different creation methods, saving time and eliminating repetitive tasks. Built with Next.js 15 and TypeScript, it features intelligent question detection, a metrics dashboard, a modern drag-and-drop interface, secure authentication with Google Workspace, a credit system integrated with MercadoPago, and seamless integrations with Google Forms API, OAuth 2.0, OpenAI, and MercadoPago, delivering a complete and professional solution for teams, educators, and professionals."
			},
			"Push Notify": {
				"name": "NOUS - Push Notify",
				"description": "This project was developed for NOUS to manage and send mass notifications to users of their application. It provides a solution for authenticating administrators, configuring service credentials, and integrating with Firebase to efficiently and securely distribute messages to all registered devices"
			},
			"Filoweb": {
				"name": "Filoweb",
				"description": "Interactive educational site that guides users through the history of western philosophy. Designed an engaging UI with navigable timelines, making complex ideas accessible to a wider audience."
			},
			"Hybeans Web": {
				"name": "Hybeans Web",
				"description": "On the Hybeans web platform I implemented customizable profiles, real-time booking system, payment checkout and conversion-oriented landing pages. Improved React performance through code-splitting and lazy loading, significantly reducing initial load times."
			},
			"Jardin Management CPanel": {
				"name": "Jardin Management CPanel",
				"description": "Inventory management panel for a second-hand clothing store. Delivered a secure backend (Spring Boot + PostgreSQL) and React frontend enabling CRUD with pagination and advanced search, cutting stock errors by 40%."
			},
			"Your Lists App": {
				"name": "Your Lists App",
				"description": "Personal web app to create and organize lists for tasks, recipes or reminders. Features folders, drag-and-drop and cloud sync to access from any device."
			},
			"AEG Hornos de Cerámica": {
				"name": "AEG Ceramic Ovens",
				"description": "AEG Ceramic Ovens is a web management platform developed for a technical service specialized in ceramic ovens, featuring both a landing site and a backoffice to manage website content and customer relationships. The solution enables client management, mass communications, and service updates through a robust admin panel with advanced CRUD operations, smart filters, and integrated communication tools. Built with Next.js 14, React, TypeScript, and Firebase, it includes a WYSIWYG email editor (TinyMCE), bulk messaging via Resend API, WhatsApp integration through dynamic links, and libraries such as React Hook Form and Lucide Icons. Key features include client management with validations and paginated tables, sending personalized emails and WhatsApps with templates, editing services and pricing, a suggestion module with status and priority tracking, as well as technical capabilities like pagination, JSON validations, image uploads, and responsive design."
			}
		}
	},
	"contact": {
		"my_email": "luis.espinoza.nav@outlook.com",
		"my_phone_number": "+54 9 11 2388-1314",
		"linkedin_label": "Linkedin"
	},
	"footer": {
		"email_short": "Email",
		"call": "Call"
	}
}