{
    "landing": {
      "title": "Luis Espinoza\nFront end solutions",
      "message": "With years of experience and a focus on the best technologies in the market, I am ready to transform your ideas into real projects. Specializing in React, Next.js, and React Native, I provide web and mobile development services known for their quality and efficiency",
      "button": "Lets talk"
    },
    "header": {
      "skills": "Skills",
      "works": "Works",
      "ethos": "Ethos",
      "contact": "Contact",
      "cv": "CV"
    },
    "skills": {
      "title": "SKILLS",
      "sections": {
        "0": {
          "title": "Frontend & Mobile Development",
          "item_0": "React & React Native: Extensive experience in building reusable and performance-optimized components.",
          "item_1": "HTML, CSS, JavaScript: Mastery of fundamental concepts with the ability to write clean and semantic code.",
          "item_2": "UI Programming: Utilization of tools like React, React Native, MST, and Figma to create high-quality and intuitive user interfaces.",
          "item_3": "Version Control: Knowledge of Git with the ability to work with remote repositories and manage version conflicts."
        },
        "1": {
          "title": "Application Architecture & Design",
          "item_0":"Application Architecture: Understanding of React and React Native application architecture, with the ability to design and maintain an organized and scalable folder structure.",
          "item_1": "Responsive & Accessible Design: Development and maintenance of optimized and accessible user experiences through responsive design techniques and accessibility practices.",
          "item_2": "Firebase: Proficient in managing Firebase Realtime Database, Firestore for database management, user authentication, and integration of push notifications."
        },
        "2": {
          "title": "Project Management & Team Collaboration",
          "item_0": "Project Management Tools: Skilled in collaborating with teams using project management tools like Jira and communication platforms like Slack.",
          "item_1": "Collaboration & Communication: Effective communication and collaboration with team members, clients, and stakeholders, fostering a collaborative work environment."
        },
        "3": {
          "title": "Problem Solving & Continuous Learning",
          "item_0": "Problem Analysis & Resolution: Effective analysis and resolution of problems in software development.",
          "item_1": "Quick Learning: Rapid adaptation to new technologies and tools in mobile and web application development.",
          "item_2": "Innovative Solutions: Commitment to staying updated with the latest technologies and development practices to offer innovative and effective solutions."
      
        }
      }
    },
    "ethos": {
      "title": "Ethos",
      "content_1": "My name is Luis Espinoza, a software developer specialized in web and mobile applications. My life has been a constant journey of seeking and creating knowledge, combining studies in Philosophy at the University of Buenos Aires (UBA) and Computer Science at the National University of General Sarmiento (UNGS), with programming courses at the National Technological University (UTN).",
      "content_2": "I am self-taught and value continuous learning, which is why I stay updated with the latest technologies, especially in the React ecosystem, React Native, HTML, CSS, and JavaScript.",
      "content_3": "Outside of the professional realm, I am passionate about philosophy, reading, and writing. This nourishes my creativity and offers me new perspectives. These activities enrich my approach to software development, allowing me to tackle challenges in an innovative manner.",
      "content_4": "I value trust, effective communication, and collaboration. My strong communication skills enable me to work efficiently with teams and clients, ensuring successful projects. My commitment is to create exceptional applications that provide memorable and rewarding experiences. Reliable, dedicated to excellence, always ready to face new challenges with enthusiasm."
    },
    "works": {
      "title": "Works"
    },
    "contact": {
      "email": "luis.espinoza.nav@live.com",
      "phone_number": "+54 9 11 2388-1314",
      "linkedin_label": "Linkedin"
    }
  }
  