{
	"landing": {
		"title": "Luis Espinoza\nMobile & Web Engineer",
		"message": "Impulso experiencias digitales de alto rendimiento con React, React Native y Node.js. Desarrollo apps FinTech y EventTech que llegan a miles de usuarios cada mes.",
		"button": "Hablemos"
	},
	"header": {
		"skills": "Skills",
		"works": "Trabajos",
		"ethos": "Ethos",
		"contact": "Contacto",
		"cv": "CV",
		"download_cv": "Descargar"
	},
	"skills": {
		"title": "SKILLS",
		"sections": {
			"0": {
				"title": "Desarrollo Frontend & Mobile",
				"item_0": "React & React Native: Desarrollo de interfaces modulares y de alto rendimiento para web y mobile, aplicando mejores prácticas de accesibilidad y SEO.",
				"item_1": "HTML, CSS, JavaScript: Código semántico, responsive y optimizado que garantiza una experiencia consistente en cualquier dispositivo.",
				"item_2": "UI/UX & Prototipado: Diseño de flujos y prototipos en Figma trasladados a componentes escalables con TypeScript y CSS Modules.",
				"item_3": "Control de Versiones: Fluidez con Git (GitFlow, PR reviews, CI/CD) y colaboración en equipos distribuidos."
			},
			"1": {
				"title": "Arquitectura & Diseño de Aplicaciones",
				"item_0": "Clean Architecture & SOLID: Estructuración de proyectos React/React Native escalables y fáciles de mantener.",
				"item_1": "Diseño Responsivo & Accesible: Adopción de WCAG y Mobile-First para llegar al 100 % de la audiencia.",
				"item_2": "Backend-as-a-Service: Firebase (Auth, Firestore, Cloud Functions) y AWS Serverless para acelerar el time-to-market."
			},
			"2": {
				"title": "Gestión de Proyectos & Colaboración",
				"item_0": "Metodologías ágiles (Scrum, Kanban) y herramientas como Jira o Linear para entregas iterativas.",
				"item_1": "Comunicación puente entre negocio y tecnología, facilitando decisiones informadas y eficiencia del equipo."
			},
			"3": {
				"title": "Resolución de Problemas & Aprendizaje Continuo",
				"item_0": "Debugging & Tuning: Identificación de cuellos de botella con herramientas de profiling y observabilidad.",
				"item_1": "Aprendizaje continuo: Investigación autodirigida y adaptación rápida a nuevas tecnologías.",
				"item_2": "Innovación: Propuesta de mejoras y automatizaciones que reducen tiempo de desarrollo y errores."
			}
		}
	},
	"ethos": {
		"title": "ETHOS",
		"content_1": "Explorador de ideas: de la Filosofía a la Ingeniería, combino pensamiento crítico y creatividad para diseñar tecnología que mejore la vida de las personas.",
		"content_2": "Creo experiencias digitales, impulsado por una mentalidad de aprendizaje continuo y pasión por la excelencia.",
		"content_3": "Mi curiosidad se alimenta de la lectura, la escritura y el arte; estas disciplinas amplían mi perspectiva y nutren mi capacidad para resolver problemas de manera innovadora.",
		"content_4": "Trabajo bajo valores de confianza, comunicación transparente y colaboración; pilares que me permiten liderar equipos hacia productos sostenibles y memorables."
	},
	"works": {
		"title": "TRABAJOS",
		"projects": {
			"Pago Fácil & Western Union": {
				"name": " Pago Fácil & Western Union",
				"description": "Colaboro en la evolución de la billetera digital Pago Fácil, desarrollada junto a Western Union. Con más de un millón de descargas y cientos de miles de usuarios activos, lidero la incorporación de nuevas funcionalidades y refactorizaciones que mejoran la performance y la experiencia de usuario, manteniendo la estabilidad en producción. Stack: React Native, TypeScript, Redux, REST APIs y Clean Architecture."
			},
			"0-Registros": {
				"name": "0-Registros",
				"description": "Proyecto experimental que fusiona poesía, arte generativo y tecnología para explorar preguntas existenciales. Desarrollado con Next.js y TypeScript en monorepo, emplea p5.js para visuales dinámicos, Firebase como backend y traducción i18n. Creé una experiencia inmersiva minimalista que combina texto y gráficos en tiempo real."
			},
			"Hybeans App": {
				"name": "Hybeans App",
				"description": "En Hybeans, plataforma de gestión de eventos con funcionalidades sociales, diseñé e implementé módulos críticos en iOS y Android: autenticación, perfiles dinámicos, feed en tiempo real, notificaciones push, reservas y venta de productos. Coordiné con diseño, backend y QA para publicar releases en plazos ajustados y asegurar un rendimiento estable durante eventos."
			},
			"Push Notify": {
				"name": "NOUS - Push Notify",
				"description": "Este proyecto fue desarrollado para NOUS con el objetivo de gestionar y enviar notificaciones masivas a los usuarios de su aplicación. Se implementó una solución que permite autenticar administradores, configurar credenciales de servicio y utilizar la integración con Firebase para distribuir mensajes de manera eficiente y segura a todos los dispositivos registrados."
			},
			"FastForm": {
				"name": "Fast Form",
				"description": "FastForm es una aplicación web SaaS que automatiza la creación de formularios de Google mediante un conjunto de herramientas: un chat con IA que guía y optimiza la generación de formularios, la posibilidad de importar automáticamente desde archivos Excel/CSV, y un builder manual intuitivo, con opciones para guardar borradores y combinar distintos métodos de creación, eliminando tareas repetitivas y ahorrando tiempo. Desarrollada con Next.js 15 y TypeScript, incluye detección inteligente de preguntas, un dashboard con métricas, diseño moderno con drag & drop, autenticación segura con Google Workspace, sistema de créditos con MercadoPago, e integraciones con Google Forms API, OAuth 2.0, OpenAI y MercadoPago, ofreciendo una solución integral y profesional para equipos, educadores y profesionales."
			},
			"Filoweb": {
				"name": "Filoweb",
				"description": "Sitio educativo interactivo que recorre la historia de la filosofía occidental. Diseñé una interfaz visual atractiva y cronogramas navegables que facilitan la exploración de corrientes y autores, acercando la filosofía a nuevos públicos."
			},
			"Hybeans Web": {
				"name": "Hybeans Web",
				"description": "En la versión web de Hybeans implementé perfiles personalizables, sistema de reservas con confirmación en tiempo real, checkout de pagos y landing pages optimizadas para conversión. Optimicé el rendimiento de React mediante code-splitting y lazy loading, reduciendo el tiempo de carga inicial."
			},
			"Jardin Management CPanel": {
				"name": "Jardin Management CPanel",
				"description": "Panel de gestión de inventario para una tienda de ropa de segunda mano. Implementé un backend seguro (Spring Boot + PostgreSQL) y un frontend React que permite CRUD con paginación y búsqueda avanzada, reduciendo errores de stock en 40 %."
			},
			"Your Lists App": {
				"name": "Your Lists App",
				"description": "Aplicación web personal para crear y organizar listas de tareas, recetas o recordatorios. Incluye carpetas, drag-and-drop y sincronización en la nube para acceder desde cualquier dispositivo."
			},
			"AEG Hornos de Cerámica": {
				"name": "AEG Service - Hornos de Cerámica",
				"description": "Sitio web profesional para servicio de reparación y mantenimiento de hornos de cerámica. Desarrollado con Bootstrap y desplegado en Netlify, conectado con Firebase Remote Config para actualizar contenido dinámicamente sin necesidad de redeploy. Incluye formularios de contacto, galería de trabajos realizados y información detallada de servicios. Optimizado para SEO y conversión de clientes en la zona de CABA y AMBA."
			},
			"Digital Consultora - Retail Spark Grow": {
				"name": "Digital Consultora - Retail Spark Grow",
				"description": "Plataforma web para consultora especializada en transformación digital del retail físico. Implementado con Tailwind CSS y Bootstrap, incluye landing page moderna, formularios de contacto y casos de éxito. Diseñado para generar leads y mostrar servicios de consultoría digital."
			}
		}
	},
	"contact": {
		"my_email": "luis.espinoza.nav@outlook.com",
		"my_phone_number": "+54 9 11 2388-1314",
		"linkedin_label": "Linkedin"
	},
	"footer": {
		"email_short": "Email",
		"call": "Llamar"
	}
}